In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

C:\Users\GodHand\Anaconda3\lib\importlib\_bootstrap.py:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 192 from C header, got 216 from PyObject
  return f(*args, **kwds)
C:\Users\GodHand\Anaconda3\lib\importlib\_bootstrap.py:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 192 from C header, got 216 from PyObject
  return f(*args, **kwds)

In [2]:
from numpy.random import randn

In [3]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['M','N','O','P'])

In [4]:
df

          M         N         O         P
A  0.172899 -0.075362 -1.113677 -1.508888
B -0.444798  0.708082 -0.128709 -0.200767
C  0.950988  0.533691 -0.013762 -1.437874
D -0.509956  0.461041 -0.529552  1.662289
E -0.318480  0.134644  1.524606  2.201661

In [5]:
df > 0

       M      N      O      P
A   True  False  False  False
B  False   True  False  False
C   True   True  False  False
D  False   True  False   True
E  False   True   True   True

In [6]:
boolt = df > 0

In [7]:
boolt

       M      N      O      P
A   True  False  False  False
B  False   True  False  False
C   True   True  False  False
D  False   True  False   True
E  False   True   True   True

In [8]:
df[boolt]

          M         N         O         P
A  0.172899       NaN       NaN       NaN
B       NaN  0.708082       NaN       NaN
C  0.950988  0.533691       NaN       NaN
D       NaN  0.461041       NaN  1.662289
E       NaN  0.134644  1.524606  2.201661

In [9]:
df[df > 0]

          M         N         O         P
A  0.172899       NaN       NaN       NaN
B       NaN  0.708082       NaN       NaN
C  0.950988  0.533691       NaN       NaN
D       NaN  0.461041       NaN  1.662289
E       NaN  0.134644  1.524606  2.201661

In [10]:
df

          M         N         O         P
A  0.172899 -0.075362 -1.113677 -1.508888
B -0.444798  0.708082 -0.128709 -0.200767
C  0.950988  0.533691 -0.013762 -1.437874
D -0.509956  0.461041 -0.529552  1.662289
E -0.318480  0.134644  1.524606  2.201661

In [11]:
df[df['M'] > 0]

          M         N         O         P
A  0.172899 -0.075362 -1.113677 -1.508888
C  0.950988  0.533691 -0.013762 -1.437874

In [12]:
resultdf = df[df['M'] > 0]

In [13]:
resultdf

          M         N         O         P
A  0.172899 -0.075362 -1.113677 -1.508888
C  0.950988  0.533691 -0.013762 -1.437874

In [14]:
resultdf['O']

A   -1.113677
C   -0.013762
Name: O, dtype: float64

In [15]:
df[df['M'] > 0]['O']

A   -1.113677
C   -0.013762
Name: O, dtype: float64

In [18]:
df[(df['M'] > 0) | (df['P'] > 0)]

          M         N         O         P
A  0.172899 -0.075362 -1.113677 -1.508888
C  0.950988  0.533691 -0.013762 -1.437874
D -0.509956  0.461041 -0.529552  1.662289
E -0.318480  0.134644  1.524606  2.201661